Revit 2027 API
ZJustification Enumeration
 The justification of the framing element in Z.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZJustification
Public Enumeration ZJustification
public enum class ZJustification
type ZJustification
Members
Member name | Value | Description
Bottom | 3 |  Justification to the bottom of the element.
Center | 1 |  Justification to the geometrical center of element.
Origin | 2 |  Justification to the origin of the element.
Top | 0 |  Justification to the top of the element.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace